{
  "users": [
    {
      "id": 1,
      "name": "",
      "fullName": "President Scroob",
      "email": "spaceball1@schwartz.gov",
      "password": "12345"
    },
    {
      "email": "andymchanks@gmail.com",
      "password": "12345",
      "name": "",
      "fullName": "andy",
      "id": 2
    },
    {
      "email": "ng2@place.com",
      "password": "12345",
      "name": "",
      "fullName": "New Guy",
      "id": 3
    },
    {
      "email": "ng2@place.com",
      "password": "12345",
      "name": "",
      "fullName": "New Guy",
      "id": 4
    },
    {
      "email": "mre@faerun.net",
      "password": "12345",
      "name": "",
      "fullName": "elminster",
      "id": 5
    },
    {
      "email": "bnor@frealm.com",
      "password": "12345",
      "name": "",
      "fullName": "Bruenor",
      "id": 6
    }
  ],
  "spellBooks": [
    {
      "userId": 6,
      "spellId": 7,
      "id": 4
    },
    {
      "userId": 6,
      "spellId": 34,
      "id": 5
    },
    {
      "userId": 6,
      "spellId": 56,
      "id": 6
    },
    {
      "userId": 6,
      "spellId": 78,
      "id": 7
    },
    {
      "userId": 6,
      "spellId": 101,
      "id": 8
    },
    {
      "userId": 1,
      "spellId": 9,
      "id": 9
    },
    {
      "userId": 1,
      "spellId": 49,
      "id": 10
    },
    {
      "userId": 1,
      "spellId": 64,
      "id": 11
    },
    {
      "userId": 1,
      "spellId": 73,
      "id": 12
    },
    {
      "userId": 1,
      "spellId": 1,
      "id": 13
    },
    {
      "userId": 1,
      "spellId": 12,
      "id": 14
    },
    {
      "userId": 1,
      "spellId": 24,
      "id": 15
    },
    {
      "userId": 5,
      "spellId": 5,
      "id": 17
    },
    {
      "userId": 5,
      "spellId": 6,
      "id": 18
    }
  ],
  "spells": [
    {
      "id": 1,
      "name": "Acid Arrow",
      "desc": "A shimmering green arrow streaks toward a target within range and bursts in a spray of acid. Make a ranged spell attack against the target. On a hit, the target takes 4d4 acid damage immediately and 2d4 acid damage at the end of its next turn. On a miss, the arrow splashes the target with acid for half as much of the initial damage and no damage at the end of its next turn.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 2,
      "name": "Acid Splash",
      "desc": "You hurl a bubble of acid. Choose one creature within range, or choose two creatures within range that are within 5 feet of each other. A target must succeed on a dexterity saving throw or take 1d6 acid damage.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 3,
      "name": "Aid",
      "desc": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 4,
      "name": "Alarm",
      "desc": "You set an alarm against unwanted intrusion. Choose a door, a window, or an area within range that is no larger than a 20-foot cube. Until the spell ends, an alarm alerts you whenever a Tiny or larger creature touches or enters the warded area. When you cast the spell, you can designate creatures that won't set off the alarm. You also choose whether the alarm is mental or audible.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 5,
      "name": "Alter Self",
      "desc": "You assume a different form. When you cast the spell, choose one of the following options, the effects of which last for the duration of the spell. While the spell lasts, you can end one option as an action to gain the benefits of a different one.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 6,
      "name": "Animal Friendship",
      "desc": "This spell lets you convince a beast that you mean it no harm. Choose a beast that you can see within range. It must see and hear you. If the beast's Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a wisdom saving throw or be charmed by you for the spell's duration. If you or one of your companions harms the target, the spells ends.",
      "school": "Enchantment",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 7,
      "name": "Animal Messenger",
      "desc": "By means of this spell, you use an animal to deliver a message. Choose a Tiny beast you can see within range, such as a squirrel, a blue jay, or a bat. You specify a location, which you must have visited, and a recipient who matches a general description, such as \"a man or woman dressed in the uniform of the town guard\" or \"a red-haired dwarf wearing a pointed hat.\" You also speak a message of up to twenty-five words. The target beast travels for the duration of the spell toward the specified location, covering about 50 miles per 24 hours for a flying messenger, or 25 miles for other animals.",
      "school": "Enchantment",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 8,
      "name": "Animal Shapes",
      "desc": "Your magic turns others into beasts. Choose any number of willing creatures that you can see within range. You transform each target into the form of a Large or smaller beast with a challenge rating of 4 or lower. On subsequent turns, you can use your action to transform affected creatures into new forms.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 9,
      "name": "Animate Dead",
      "desc": "This spell creates an undead servant. Choose a pile of bones or a corpse of a Medium or Small humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes a skeleton if you chose bones or a zombie if you chose a corpse (the GM has the creature's game statistics).",
      "school": "Necromancy",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 10,
      "name": "Animate Objects",
      "desc": "Objects come to life at your command. Choose up to ten nonmagical objects within range that are not being worn or carried. Medium targets count as two objects, Large targets count as four objects, Huge targets count as eight objects. You can't animate any object larger than Huge. Each target animates and becomes a creature under your control until the spell ends or until reduced to 0 hit points.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 11,
      "name": "Antilife Shell",
      "desc": "A shimmering barrier extends out from you in a 10-foot radius and moves with you, remaining centered on you and hedging out creatures other than undead and constructs. The barrier lasts for the duration.",
      "school": "Abjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 12,
      "name": "Antimagic Field",
      "desc": "A 10-foot-radius invisible sphere of antimagic surrounds you. This area is divorced from the magical energy that suffuses the multiverse. Within the sphere, spells can't be cast, summoned creatures disappear, and even magic items become mundane. Until the spell ends, the sphere moves with you, centered on you.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 13,
      "name": "Antipathy/Sympathy",
      "desc": "This spell attracts or repels creatures of your choice. You target something within range, either a Huge or smaller object or creature or an area that is no larger than a 200-foot cube. Then specify a kind of intelligent creature, such as red dragons, goblins, or vampires. You invest the target with an aura that either attracts or repels the specified creatures for the duration. Choose antipathy or sympathy as the aura's effect.",
      "school": "Enchantment",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 14,
      "name": "Arcane Eye",
      "desc": "You create an invisible, magical eye within range that hovers in the air for the duration.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 15,
      "name": "Arcane Hand",
      "desc": "You create a Large hand of shimmering, translucent force in an unoccupied space that you can see within range. The hand lasts for the spell's duration, and it moves at your command, mimicking the movements of your own hand.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 16,
      "name": "Arcane Lock",
      "desc": "You touch a closed door, window, gate, chest, or other entryway, and it becomes locked for the duration. You and the creatures you designate when you cast this spell can open the object normally. You can also set a password that, when spoken within 5 feet of the object, suppresses this spell for 1 minute. Otherwise, it is impassable until it is broken or the spell is dispelled or suppressed. Casting knock on the object suppresses arcane lock for 10 minutes.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 17,
      "name": "Arcane Sword",
      "desc": "You create a sword-shaped plane of force that hovers within range. It lasts for the duration.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 18,
      "name": "Arcanist's Magic Aura",
      "desc": "You place an illusion on a creature or an object you touch so that divination spells reveal false information about it. The target can be a willing creature or an object that isn't being carried or worn by another creature.",
      "school": "Illusion",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 19,
      "name": "Astral Projection",
      "desc": "You and up to eight willing creatures within range project your astral bodies into the Astral Plane (the spell fails and the casting is wasted if you are already on that plane). The material body you leave behind is unconscious and in a state of suspended animation; it doesn't need food or air and doesn't age.",
      "school": "Necromancy",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 20,
      "name": "Augury",
      "desc": "By casting gem-inlaid sticks, rolling dragon bones, laying out ornate cards, or employing some other divining tool, you receive an omen from an otherworldly entity about the results of a specific course of action that you plan to take within the next 30 minutes. The GM chooses from the following possible omens:",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 21,
      "name": "Awaken",
      "desc": "After spending the casting time tracing magical pathways within a precious gemstone, you touch a Huge or smaller beast or plant. The target must have either no Intelligence score or an Intelligence of 3 or less. The target gains an Intelligence of 10. The target also gains the ability to speak one language you know. If the target is a plant, it gains the ability to move its limbs, roots, vines, creepers, and so forth, and it gains senses similar to a human's. Your GM chooses statistics appropriate for the awakened plant, such as the statistics for the awakened shrub or the awakened tree.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 22,
      "name": "Bane",
      "desc": "Up to three creatures of your choice that you can see within range must make charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw.",
      "school": "Enchantment",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 23,
      "name": "Banishment",
      "desc": "You attempt to send one creature that you can see within range to another plane of existence. The target must succeed on a charisma saving throw or be banished.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 24,
      "name": "Barkskin",
      "desc": "You touch a willing creature. Until the spell ends, the target's skin has a rough, bark-like appearance, and the target's AC can't be less than 16, regardless of what kind of armor it is wearing.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 25,
      "name": "Beacon of Hope",
      "desc": "This spell bestows hope and vitality. Choose any number of creatures within range. For the duration, each target has advantage on wisdom saving throws and death saving throws, and regains the maximum number of hit points possible from any healing.",
      "school": "Abjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 26,
      "name": "Bestow Curse",
      "desc": "You touch a creature, and that creature must succeed on a wisdom saving throw or become cursed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options:",
      "school": "Necromancy",
      "components": "['V', 'S']"
    },
    {
      "id": 27,
      "name": "Black Tentacles",
      "desc": "Squirming, ebony tentacles fill a 20-foot square on ground that you can see within range. For the duration, these tentacles turn the ground in the area into difficult terrain.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 28,
      "name": "Blade Barrier",
      "desc": "You create a vertical wall of whirling, razor-sharp blades made of magical energy. The wall appears within range and lasts for the duration. You can make a straight wall up to 100 feet long, 20 feet high, and 5 feet thick, or a ringed wall up to 60 feet in diameter, 20 feet high, and 5 feet thick. The wall provides three-quarters cover to creatures behind it, and its space is difficult terrain.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 29,
      "name": "Bless",
      "desc": "You bless up to three creatures of your choice within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target can roll a d4 and add the number rolled to the attack roll or saving throw.",
      "school": "Enchantment",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 30,
      "name": "Blight",
      "desc": "Necromantic energy washes over a creature of your choice that you can see within range, draining moisture and vitality from it. The target must make a constitution saving throw. The target takes 8d8 necrotic damage on a failed save, or half as much damage on a successful one. The spell has no effect on undead or constructs.",
      "school": "Necromancy",
      "components": "['V', 'S']"
    },
    {
      "id": 31,
      "name": "Blindness/Deafness",
      "desc": "You can blind or deafen a foe. Choose one creature that you can see within range to make a constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a constitution saving throw. On a success, the spell ends.",
      "school": "Necromancy",
      "components": "['V']"
    },
    {
      "id": 32,
      "name": "Blink",
      "desc": "Roll a d20 at the end of each of your turns for the duration of the spell. On a roll of 11 or higher, you vanish from your current plane of existence and appear in the Ethereal Plane (the spell fails and the casting is wasted if you were already on that plane). At the start of your next turn, and when the spell ends if you are on the Ethereal Plane, you return to an unoccupied space of your choice that you can see within 10 feet of the space you vanished from. If no unoccupied space is available within that range, you appear in the nearest unoccupied space (chosen at random if more than one space is equally near). You can dismiss this spell as an action.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 33,
      "name": "Blur",
      "desc": "Your body becomes blurred, shifting and wavering to all who can see you. For the duration, any creature has disadvantage on attack rolls against you. An attacker is immune to this effect if it doesn't rely on sight, as with blindsight, or can see through illusions, as with truesight.",
      "school": "Illusion",
      "components": "['V']"
    },
    {
      "id": 34,
      "name": "Branding Smite",
      "desc": "The next time you hit a creature with a weapon attack before this spell ends, the weapon gleams with astral radiance as you strike. The attack deals an extra 2d6 radiant damage to the target, which becomes visible if it's invisible, and the target sheds dim light in a 5-foot radius and can't become invisible until the spell ends.",
      "school": "Evocation",
      "components": "['V']"
    },
    {
      "id": 35,
      "name": "Burning Hands",
      "desc": "As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 36,
      "name": "Call Lightning",
      "desc": "A storm cloud appears in the shape of a cylinder that is 10 feet tall with a 60-foot radius, centered on a point you can see 100 feet directly above you. The spell fails if you can't see a point in the air where the storm cloud could appear (for example, if you are in a room that can't accommodate the cloud).",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 37,
      "name": "Calm Emotions",
      "desc": "You attempt to suppress strong emotions in a group of people. Each humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a charisma saving throw; a creature can choose to fail this saving throw if it wishes. If a creature fails its saving throw, choose one of the following two effects. You can suppress any effect causing a target to be charmed or frightened. When this spell ends, any suppressed effect resumes, provided that its duration has not expired in the meantime.",
      "school": "Enchantment",
      "components": "['V', 'S']"
    },
    {
      "id": 38,
      "name": "Chain Lightning",
      "desc": "You create a bolt of lightning that arcs toward a target of your choice that you can see within range. Three bolts then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the bolts.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 39,
      "name": "Charm Person",
      "desc": "You attempt to charm a humanoid you can see within range. It must make a wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you.",
      "school": "Enchantment",
      "components": "['V', 'S']"
    },
    {
      "id": 40,
      "name": "Chill Touch",
      "desc": "You create a ghostly, skeletal hand in the space of a creature within range. Make a ranged spell attack against the creature to assail it with the chill of the grave. On a hit, the target takes 1d8 necrotic damage, and it can't regain hit points until the start of your next turn. Until then, the hand clings to the target.",
      "school": "Necromancy",
      "components": "['V', 'S']"
    },
    {
      "id": 41,
      "name": "Circle of Death",
      "desc": "A sphere of negative energy ripples out in a 60-foot radius sphere from a point within range. Each creature in that area must make a constitution saving throw. A target takes 8d6 necrotic damage on a failed save, or half as much damage on a successful one.",
      "school": "Necromancy",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 42,
      "name": "Clairvoyance",
      "desc": "You create an invisible sensor within range in a location familiar to you (a place you have visited or seen before) or in an obvious location that is unfamiliar to you (such as behind a door, around a corner, or in a grove of trees). The sensor remains in place for the duration, and it can't be attacked or otherwise interacted with.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 43,
      "name": "Clone",
      "desc": "This spell grows an inert duplicate of a living creature as a safeguard against death. This clone forms inside a sealed vessel and grows to full size and maturity after 120 days; you can also choose to have the clone be a younger version of the same creature. It remains inert and endures indefinitely, as long as its vessel remains undisturbed.",
      "school": "Necromancy",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 44,
      "name": "Cloudkill",
      "desc": "You create a 20-foot-radius sphere of poisonous, yellow-green fog centered on a point you choose within range. The fog spreads around corners. It lasts for the duration or until strong wind disperses the fog, ending the spell. Its area is heavily obscured.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 45,
      "name": "Color Spray",
      "desc": "A dazzling array of flashing, colored light springs from your hand. Roll 6d10; the total is how many hit points of creatures this spell can effect. Creatures in a 15-foot cone originating from you are affected in ascending order of their current hit points (ignoring unconscious creatures and creatures that can't see).",
      "school": "Illusion",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 46,
      "name": "Command",
      "desc": "You speak a one-word command to a creature you can see within range. The target must succeed on a wisdom saving throw or follow the command on its next turn. The spell has no effect if the target is undead, if it doesn't understand your language, or if your command is directly harmful to it.",
      "school": "Enchantment",
      "components": "['V']"
    },
    {
      "id": 47,
      "name": "Commune",
      "desc": "You contact your deity or a divine proxy and ask up to three questions that can be answered with a yes or no. You must ask your questions before the spell ends. You receive a correct answer for each question.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 48,
      "name": "Commune With Nature",
      "desc": "You briefly become one with nature and gain knowledge of the surrounding territory. In the outdoors, the spell gives you knowledge of the land within 3 miles of you. In caves and other natural underground settings, the radius is limited to 300 feet. The spell doesn't function where nature has been replaced by construction, such as in dungeons and towns.",
      "school": "Divination",
      "components": "['V', 'S']"
    },
    {
      "id": 49,
      "name": "Comprehend Languages",
      "desc": "For the duration, you understand the literal meaning of any spoken language that you hear. You also understand any written language that you see, but you must be touching the surface on which the words are written. It takes about 1 minute to read one page of text.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 50,
      "name": "Compulsion",
      "desc": "Creatures of your choice that you can see within range and that can hear you must make a wisdom saving throw. A target automatically succeeds on this saving throw if it can't be charmed. On a failed save, a target is affected by this spell. Until the spell ends, you can use a bonus action on each of your turns to designate a direction that is horizontal to you. Each affected target must use as much of its movement as possible to move in that direction on its next turn. It can take any action before it moves. After moving in this way, it can make another Wisdom save to try to end the effect.",
      "school": "Enchantment",
      "components": "['V', 'S']"
    },
    {
      "id": 51,
      "name": "Cone of Cold",
      "desc": "A blast of cold air erupts from your hands. Each creature in a 60-foot cone must make a constitution saving throw. A creature takes 8d8 cold damage on a failed save, or half as much damage on a successful one.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 52,
      "name": "Confusion",
      "desc": "This spell assaults and twists creatures' minds, spawning delusions and provoking uncontrolled action. Each creature in a 10-foot-radius sphere centered on a point you choose within range must succeed on a Wisdom saving throw when you cast this spell or be affected by it.",
      "school": "Enchantment",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 53,
      "name": "Conjure Animals",
      "desc": "You summon fey spirits that take the form of beasts and appear in unoccupied spaces that you can see within range. Choose one of the following options for what appears:",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 54,
      "name": "Conjure Celestial",
      "desc": "You summon a celestial of challenge rating 4 or lower, which appears in an unoccupied space that you can see within range. The celestial disappears when it drops to 0 hit points or when the spell ends.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 55,
      "name": "Conjure Elemental",
      "desc": "You call forth an elemental servant. Choose an area of air, earth, fire, or water that fills a 10-foot cube within range. An elemental of challenge rating 5 or lower appropriate to the area you chose appears in an unoccupied space within 10 feet of it. For example, a fire elemental emerges from a bonfire, and an earth elemental rises up from the ground. The elemental disappears when it drops to 0 hit points or when the spell ends.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 56,
      "name": "Conjure Fey",
      "desc": "You summon a fey creature of challenge rating 6 or lower, or a fey spirit that takes the form of a beast of challenge rating 6 or lower. It appears in an unoccupied space that you can see within range. The fey creature disappears when it drops to 0 hit points or when the spell ends.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 57,
      "name": "Conjure Minor Elementals",
      "desc": "You summon elementals that appear in unoccupied spaces that you can see within range. You choose one the following options for what appears:",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 58,
      "name": "Conjure Woodland Beings",
      "desc": "You summon fey creatures that appear in unoccupied spaces that you can see within range. Choose one of the following options for what appears:",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 59,
      "name": "Contact Other Plane",
      "desc": "You mentally contact a demigod, the spirit of a long-dead sage, or some other mysterious entity from another plane. Contacting this extraplanar intelligence can strain or even break your mind. When you cast this spell, make a DC 15 intelligence saving throw. On a failure, you take 6d6 psychic damage and are insane until you finish a long rest. While insane, you can't take actions, can't understand what other creatures say, can't read, and speak only in gibberish. A greater restoration spell cast on you ends this effect.",
      "school": "Divination",
      "components": "['V']"
    },
    {
      "id": 60,
      "name": "Contagion",
      "desc": "Your touch inflicts disease. Make a melee spell attack against a creature within your reach. On a hit, you afflict the creature with a disease of your choice from any of the ones described below.",
      "school": "Necromancy",
      "components": "['V', 'S']"
    },
    {
      "id": 61,
      "name": "Contingency",
      "desc": "Choose a spell of 5th level or lower that you can cast, that has a casting time of 1 action, and that can target you. You cast that spell--called the contingent spell--as part of casting contingency, expending spell slots for both, but the contingent spell doesn't come into effect. Instead, it takes effect when a certain circumstance occurs. You describe that circumstance when you cast the two spells. For example, a contingency cast with water breathing might stipulate that water breathing comes into effect when you are engulfed in water or a similar liquid.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 62,
      "name": "Continual Flame",
      "desc": "A flame, equivalent in brightness to a torch, springs forth from an object that you touch. The effect looks like a regular flame, but it creates no heat and doesn't use oxygen. A continual flame can be covered or hidden but not smothered or quenched.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 63,
      "name": "Control Water",
      "desc": "Until the spell ends, you control any freestanding water inside an area you choose that is a cube up to 100 feet on a side. You can choose from any of the following effects when you cast this spell. As an action on your turn, you can repeat the same effect or choose a different one.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 64,
      "name": "Control Weather",
      "desc": "You take control of the weather within 5 miles of you for the duration. You must be outdoors to cast this spell. Moving to a place where you don't have a clear path to the sky ends the spell early.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 65,
      "name": "Counterspell",
      "desc": "You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a success, the creature's spell fails and has no effect.",
      "school": "Abjuration",
      "components": "['S']"
    },
    {
      "id": 66,
      "name": "Create Food and Water",
      "desc": "You create 45 pounds of food and 30 gallons of water on the ground or in containers within range, enough to sustain up to fifteen humanoids or five steeds for 24 hours. The food is bland but nourishing, and spoils if uneaten after 24 hours. The water is clean and doesn't go bad.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 67,
      "name": "Create or Destroy Water",
      "desc": "You either create or destroy water.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 68,
      "name": "Create Undead",
      "desc": "You can cast this spell only at night. Choose up to three corpses of Medium or Small humanoids within range. Each corpse becomes a ghoul under your control. (The GM has game statistics for these creatures.)",
      "school": "Necromancy",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 69,
      "name": "Creation",
      "desc": "You pull wisps of shadow material from the Shadowfell to create a nonliving object of vegetable matter within range: soft goods, rope, wood, or something similar. You can also use this spell to create mineral objects such as stone, crystal, or metal. The object created must be no larger than a 5-foot cube, and the object must be of a form and material that you have seen before.",
      "school": "Illusion",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 70,
      "name": "Cure Wounds",
      "desc": "A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 71,
      "name": "Dancing Lights",
      "desc": "You create up to four torch-sized lights within range, making them appear as torches, lanterns, or glowing orbs that hover in the air for the duration. You can also combine the four lights into one glowing vaguely humanoid form of Medium size. Whichever form you choose, each light sheds dim light in a 10-foot radius.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 72,
      "name": "Darkness",
      "desc": "Magical darkness spreads from a point you choose within range to fill a 15-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can't see through this darkness, and nonmagical light can't illuminate it.",
      "school": "Evocation",
      "components": "['V', 'M']"
    },
    {
      "id": 73,
      "name": "Darkvision",
      "desc": "You touch a willing creature to grant it the ability to see in the dark. For the duration, that creature has darkvision out to a range of 60 feet.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 74,
      "name": "Daylight",
      "desc": "A 60-foot-radius sphere of light spreads out from a point you choose within range. The sphere is bright light and sheds dim light for an additional 60 feet.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 75,
      "name": "Death Ward",
      "desc": "You touch a creature and grant it a measure of protection from death.",
      "school": "Abjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 76,
      "name": "Delayed Blast Fireball",
      "desc": "A beam of yellow light flashes from your pointing finger, then condenses to linger at a chosen point within range as a glowing bead for the duration. When the spell ends, either because your concentration is broken or because you decide to end it, the bead blossoms with a low roar into an explosion of flame that spreads around corners. Each creature in a 20-foot-radius sphere centered on that point must make a dexterity saving throw. A creature takes fire damage equal to the total accumulated damage on a failed save, or half as much damage on a successful one.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 77,
      "name": "Demiplane",
      "desc": "You create a shadowy door on a flat solid surface that you can see within range. The door is large enough to allow Medium creatures to pass through unhindered. When opened, the door leads to a demiplane that appears to be an empty room 30 feet in each dimension, made of wood or stone. When the spell ends, the door disappears, and any creatures or objects inside the demiplane remain trapped there, as the door also disappears from the other side.",
      "school": "Conjuration",
      "components": "['S']"
    },
    {
      "id": 78,
      "name": "Detect Evil and Good",
      "desc": "For the duration, you know if there is an aberration, celestial, elemental, fey, fiend, or undead within 30 feet of you, as well as where the creature is located. Similarly, you know if there is a place or object within 30 feet of you that has been magically consecrated or desecrated.",
      "school": "Divination",
      "components": "['V', 'S']"
    },
    {
      "id": 79,
      "name": "Detect Magic",
      "desc": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.",
      "school": "Divination",
      "components": "['V', 'S']"
    },
    {
      "id": 80,
      "name": "Detect Poison and Disease",
      "desc": "For the duration, you can sense the presence and location of poisons, poisonous creatures, and diseases within 30 feet of you. You also identify the kind of poison, poisonous creature, or disease in each case.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 81,
      "name": "Detect Thoughts",
      "desc": "For the duration, you can read the thoughts of certain creatures. When you cast the spell and as your action on each turn until the spell ends, you can focus your mind on any one creature that you can see within 30 feet of you. If the creature you choose has an Intelligence of 3 or lower or doesn't speak any language, the creature is unaffected.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 82,
      "name": "Dimension Door",
      "desc": "You teleport yourself from your current location to any other spot within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as \"200 feet straight downward\" or \"upward to the northwest at a 45-degree angle, 300 feet.\"",
      "school": "Conjuration",
      "components": "['V']"
    },
    {
      "id": 83,
      "name": "Disguise Self",
      "desc": "You make yourself--including your clothing, armor, weapons, and other belongings on your person--look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can't change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you.",
      "school": "Illusion",
      "components": "['V', 'S']"
    },
    {
      "id": 84,
      "name": "Disintegrate",
      "desc": "A thin green ray springs from your pointing finger to a target that you can see within range. The target can be a creature, an object, or a creation of magical force, such as the wall created by wall of force.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 85,
      "name": "Dispel Evil and Good",
      "desc": "Shimmering energy surrounds and protects you from fey, undead, and creatures originating from beyond the Material Plane. For the duration, celestials, elementals, fey, fiends, and undead have disadvantage on attack rolls against you.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 86,
      "name": "Dispel Magic",
      "desc": "Choose one creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends.",
      "school": "Abjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 87,
      "name": "Divination",
      "desc": "Your magic and an offering put you in contact with a god or a god's servants. You ask a single question concerning a specific goal, event, or activity to occur within 7 days. The GM offers a truthful reply. The reply might be a short phrase, a cryptic rhyme, or an omen.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 88,
      "name": "Divine Favor",
      "desc": "Your prayer empowers you with divine radiance. Until the spell ends, your weapon attacks deal an extra 1d4 radiant damage on a hit.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 89,
      "name": "Divine Word",
      "desc": "You utter a divine word, imbued with the power that shaped the world at the dawn of creation. Choose any number of creatures you can see within range. Each creature that can hear you must make a Charisma saving throw. On a failed save, a creature suffers an effect based on its current hit points:",
      "school": "Evocation",
      "components": "['V']"
    },
    {
      "id": 90,
      "name": "Dominate Beast",
      "desc": "You attempt to beguile a creature that you can see within range. It must succeed on a wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.",
      "school": "Enchantment",
      "components": "['V', 'S']"
    },
    {
      "id": 91,
      "name": "Dominate Monster",
      "desc": "You attempt to beguile a creature that you can see within range. It must succeed on a wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.",
      "school": "Enchantment",
      "components": "['V', 'S']"
    },
    {
      "id": 92,
      "name": "Dominate Person",
      "desc": "You attempt to beguile a humanoid that you can see within range. It must succeed on a wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.",
      "school": "Enchantment",
      "components": "['V', 'S']"
    },
    {
      "id": 93,
      "name": "Dream",
      "desc": "This spell shapes a creature's dreams. Choose a creature known to you as the target of this spell. The target must be on the same plane of existence as you. Creatures that don't sleep, such as elves, can't be contacted by this spell. You, or a willing creature you touch, enters a trance state, acting as a messenger.",
      "school": "Illusion",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 94,
      "name": "Druidcraft",
      "desc": "Whispering to the spirits of nature, you create one of the following effects within 'range':",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 95,
      "name": "Earthquake",
      "desc": "You create a seismic disturbance at a point on the ground that you can see within range. For the duration, an intense tremor rips through the ground in a 100-foot-radius circle centered on that point and shakes creatures and structures in contact with the ground in that area.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 96,
      "name": "Eldritch Blast",
      "desc": "A beam of crackling energy streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 force damage. The spell creates more than one beam when you reach higher levels: two beams at 5th level, three beams at 11th level, and four beams at 17th level. You can direct the beams at the same target or at different ones. Make a separate attack roll for each beam.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 97,
      "name": "Enhance Ability",
      "desc": "You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects; the target gains that effect until the spell ends.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 98,
      "name": "Enlarge/Reduce",
      "desc": "You cause a creature or an object you can see within range to grow larger or smaller for the duration. Choose either a creature or an object that is neither worn nor carried. If the target is unwilling, it can make a Constitution saving throw. On a success, the spell has no effect.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 99,
      "name": "Entangle",
      "desc": "Grasping weeds and vines sprout from the ground in a 20-foot square starting form a point within range. For the duration, these plants turn the ground in the area into difficult terrain.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 100,
      "name": "Enthrall",
      "desc": "You weave a distracting string of words, causing creatures of your choice that you can see within range and that can hear you to make a wisdom saving throw. Any creature that can't be charmed succeeds on this saving throw automatically, and if you or your companions are fighting a creature, it has advantage on the save. On a failed save, the target has disadvantage on Wisdom (Perception) checks made to perceive any creature other than you until the spell ends or until the target can no longer hear you. The spell ends if you are incapacitated or can no longer speak.",
      "school": "Enchantment",
      "components": "['V', 'S']"
    },
    {
      "id": 101,
      "name": "Etherealness",
      "desc": "You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can see and hear the plane you originated from, but everything there looks gray, and you can't see anything more than 60 feet away.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 102,
      "name": "Expeditious Retreat",
      "desc": "This spell allows you to move at an incredible pace. When you cast this spell, and then as a bonus action on each of your turns until the spell ends, you can take the Dash action.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 103,
      "name": "Eyebite",
      "desc": "For the spell's duration, your eyes become an inky void imbued with dread power. One creature of your choice within 60 feet of you that you can see must succeed on a wisdom saving throw or be affected by one of the following effects of your choice for the duration. On each of your turns until the spell ends, you can use your action to target another creature but can't target a creature again if it has succeeded on a saving throw against this casting of eyebite.",
      "school": "Necromancy",
      "components": "['V', 'S']"
    },
    {
      "id": 104,
      "name": "Fabricate",
      "desc": "You convert raw materials into products of the same material. For example, you can fabricate a wooden bridge from a clump of trees, a rope from a patch of hemp, and clothes from flax or wool.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 105,
      "name": "Faerie Fire",
      "desc": "Each object in a 20-foot cube within range is outlined in blue, green, or violet light (your choice). Any creature in the area when the spell is cast is also outlined in light if it fails a dexterity saving throw. For the duration, objects and affected creatures shed dim light in a 10-foot radius.",
      "school": "Evocation",
      "components": "['V']"
    },
    {
      "id": 106,
      "name": "Faithful Hound",
      "desc": "You conjure a phantom watchdog in an unoccupied space that you can see within range, where it remains for the duration, until you dismiss it as an action, or until you move more than 100 feet away from it.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 107,
      "name": "False Life",
      "desc": "Bolstering yourself with a necromantic facsimile of life, you gain 1d4 + 4 temporary hit points for the duration.",
      "school": "Necromancy",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 108,
      "name": "Fear",
      "desc": "You project a phantasmal image of a creature's worst fears. Each creature in a 30-foot cone must succeed on a wisdom saving throw or drop whatever it is holding and become frightened for the duration.",
      "school": "Illusion",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 109,
      "name": "Feather Fall",
      "desc": "Choose up to five falling creatures within range. A falling creature's rate of descent slows to 60 feet per round until the spell ends. If the creature lands before the spell ends, it takes no falling damage and can land on its feet, and the spell ends for that creature.",
      "school": "Transmutation",
      "components": "['V', 'M']"
    },
    {
      "id": 110,
      "name": "Feeblemind",
      "desc": "You blast the mind of a creature that you can see within range, attempting to shatter its intellect and personality. The target takes 4d6 psychic damage and must make an intelligence saving throw.",
      "school": "Enchantment",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 111,
      "name": "Find Familiar",
      "desc": "You gain the service of a familiar, a spirit that takes an animal form you choose: bat, cat, crab, frog (toad), hawk, lizard, octopus, owl, poisonous snake, fish (quipper), rat, raven, sea horse, spider, or weasel. Appearing in an unoccupied space within range, the familiar has the statistics of the chosen form, though it is a celestial, fey, or fiend (your choice) instead of a beast.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 112,
      "name": "Find Steed",
      "desc": "You summon a spirit that assumes the form of an unusually intelligent, strong, and loyal steed, creating a long-lasting bond with it. Appearing in an unoccupied space within range, the steed takes on a form that you choose, such as a warhorse, a pony, a camel, an elk, or a mastiff. (Your GM might allow other animals to be summoned as steeds.) The steed has the statistics of the chosen form, though it is a celestial, fey, or fiend (your choice) instead of its normal type. Additionally, if your steed has an Intelligence of 5 or less, its Intelligence becomes 6, and it gains the ability to understand one language of your choice that you speak.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 113,
      "name": "Find the Path",
      "desc": "This spell allows you to find the shortest, most direct physical route to a specific fixed location that you are familiar with on the same plane of existence. If you name a destination on another plane of existence, a destination that moves (such as a mobile fortress), or a destination that isn't specific (such as \"a green dragon's lair\"), the spell fails.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 114,
      "name": "Find Traps",
      "desc": "You sense the presence of any trap within range that is within line of sight. A trap, for the purpose of this spell, includes anything that would inflict a sudden or unexpected effect you consider harmful or undesirable, which was specifically intended as such by its creator. Thus, the spell would sense an area affected by the alarm spell, a glyph of warding, or a mechanical pit trap, but it would not reveal a natural weakness in the floor, an unstable ceiling, or a hidden sinkhole.",
      "school": "Divination",
      "components": "['V', 'S']"
    },
    {
      "id": 115,
      "name": "Finger of Death",
      "desc": "You send negative energy coursing through a creature that you can see within range, causing it searing pain. The target must make a constitution saving throw. It takes 7d8 + 30 necrotic damage on a failed save, or half as much damage on a successful one.",
      "school": "Necromancy",
      "components": "['V', 'S']"
    },
    {
      "id": 116,
      "name": "Fire Bolt",
      "desc": "You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn't being worn or carried.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 117,
      "name": "Fire Shield",
      "desc": "Thin and vaporous flame surround your body for the duration of the spell, radiating a bright light bright light in a 10-foot radius and dim light for an additional 10 feet. You can end the spell using an action to make it disappear.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 118,
      "name": "Fire Storm",
      "desc": "A storm made up of sheets of roaring flame appears in a location you choose within range. The area of the storm consists of up to ten 10-foot cubes, which you can arrange as you wish. Each cube must have at least one face adjacent to the face of another cube. Each creature in the area must make a dexterity saving throw. It takes 7d10 fire damage on a failed save, or half as much damage on a successful one.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 119,
      "name": "Fireball",
      "desc": "A bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot-radius sphere centered on that point must make a dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 120,
      "name": "Flame Blade",
      "desc": "You evoke a fiery blade in your free hand. The blade is similar in size and shape to a scimitar, and it lasts for the duration. If you let go of the blade, it disappears, but you can evoke the blade again as a bonus action.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 121,
      "name": "Flame Strike",
      "desc": "A vertical column of divine fire roars down from the heavens in a location you specify. Each creature in a 10-foot-radius, 40-foot-high cylinder centered on a point within range must make a dexterity saving throw. A creature takes 4d6 fire damage and 4d6 radiant damage on a failed save, or half as much damage on a successful one.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 122,
      "name": "Flaming Sphere",
      "desc": "A 5-foot-diameter sphere of fire appears in an unoccupied space of your choice within range and lasts for the duration. Any creature that ends its turn within 5 feet of the sphere must make a dexterity saving throw. The creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 123,
      "name": "Flesh to Stone",
      "desc": "You attempt to turn one creature that you can see within range into stone. If the target's body is made of flesh, the creature must make a constitution saving throw. On a failed save, it is restrained as its flesh begins to harden. On a successful save, the creature isn't affected.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 124,
      "name": "Floating Disk",
      "desc": "This spell creates a circular, horizontal plane of force, 3 feet in diameter and 1 inch thick, that floats 3 feet above the ground in an unoccupied space of your choice that you can see within range. The disk remains for the duration, and can hold up to 500 pounds. If more weight is placed on it, the spell ends, and everything on the disk falls to the ground.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 125,
      "name": "Fly",
      "desc": "You touch a willing creature. The target gains a flying speed of 60 feet for the duration. When the spell ends, the target falls if it is still aloft, unless it can stop the fall.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 126,
      "name": "Fog Cloud",
      "desc": "You create a 20-foot-radius sphere of fog centered on a point within range. The sphere spreads around corners, and its area is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 127,
      "name": "Forbiddance",
      "desc": "You create a ward against magical travel that protects up to 40,000 square feet of floor space to a height of 30 feet above the floor. For the duration, creatures can't teleport into the area or use portals, such as those created by the gate spell, to enter the area. The spell proofs the area against planar travel, and therefore prevents creatures from accessing the area by way of the Astral Plane, Ethereal Plane, Feywild, Shadowfell, or the plane shift spell.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 128,
      "name": "Forcecage",
      "desc": "An immobile, invisible, cube-shaped prison composed of magical force springs into existence around an area you choose within range. The prison can be a cage or a solid box, as you choose.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 129,
      "name": "Foresight",
      "desc": "You touch a willing creature and bestow a limited ability to see into the immediate future. For the duration, the target can't be surprised and has advantage on attack rolls, ability checks, and saving throws. Additionally, other creatures have disadvantage on attack rolls against the target for the duration.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 130,
      "name": "Freedom of Movement",
      "desc": "You touch a willing creature. For the duration, the target's movement is unaffected by difficult terrain, and spells and other magical effects can neither reduce the target's speed nor cause the target to be paralyzed or restrained.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 131,
      "name": "Freezing Sphere",
      "desc": "A frigid globe of cold energy streaks from your fingertips to a point of your choice within range, where it explodes in a 60-foot-radius sphere. Each creature within the area must make a constitution saving throw. On a failed save, a creature takes 10d6 cold damage. On a successful save, it takes half as much damage.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 132,
      "name": "Gaseous Form",
      "desc": "You transform a willing creature you touch, along with everything it's wearing and carrying, into a misty cloud for the duration. The spell ends if the creature drops to 0 hit points. An incorporeal creature isn't affected.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 133,
      "name": "Gate",
      "desc": "You conjure a portal linking an unoccupied space you can see within range to a precise location on a different plane of existence. The portal is a circular opening, which you can make 5 to 20 feet in diameter. You can orient the portal in any direction you choose. The portal lasts for the duration.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 134,
      "name": "Geas",
      "desc": "You place a magical command on a creature that you can see within range, forcing it to carry out some service or refrain from some action or course of activity as you decide. If the creature can understand you, it must succeed on a wisdom saving throw or become charmed by you for the duration. While the creature is charmed by you, it takes 5d10 psychic damage each time it acts in a manner directly counter to your instructions, but no more than once each day. A creature that can't understand you is unaffected by the spell.",
      "school": "Enchantment",
      "components": "['V']"
    },
    {
      "id": 135,
      "name": "Gentle Repose",
      "desc": "You touch a corpse or other remains. For the duration, the target is protected from decay and can't become undead.",
      "school": "Necromancy",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 136,
      "name": "Giant Insect",
      "desc": "You transform up to ten centipedes, three spiders, five wasps, or one scorpion within range into giant versions of their natural forms for the duration. A centipede becomes a giant centipede, a spider becomes a giant spider, a wasp becomes a giant wasp, and a scorpion becomes a giant scorpion.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 137,
      "name": "Glibness",
      "desc": "Until the spell ends, when you make a Charisma check, you can replace the number you roll with a 15. Additionally, no matter what you say, magic that would determine if you are telling the truth indicates that you are being truthful.",
      "school": "Transmutation",
      "components": "['V']"
    },
    {
      "id": 138,
      "name": "Globe of Invulnerability",
      "desc": "An immobile, faintly shimmering barrier springs into existence in a 10-foot radius around you and remains for the duration.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 139,
      "name": "Glyph of Warding",
      "desc": "When you cast this spell, you inscribe a glyph that harms other creatures, either upon a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph. If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 140,
      "name": "Goodberry",
      "desc": "Up to ten berries appear in your hand and are infused with magic for the duration. A creature can use its action to eat one berry. Eating a berry restores 1 hit point, and the berry provides enough nourishment to sustain a creature for a day.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 141,
      "name": "Grease",
      "desc": "Slick grease covers the ground in a 10-foot square centered on a point within range and turns it into difficult terrain for the duration.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 142,
      "name": "Greater Invisibility",
      "desc": "You or a creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person.",
      "school": "Illusion",
      "components": "['V', 'S']"
    },
    {
      "id": 143,
      "name": "Greater Restoration",
      "desc": "You imbue a creature you touch with positive energy to undo a debilitating effect. You can reduce the target's exhaustion level by one, or end one of the following effects on the target:",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 144,
      "name": "Guardian of Faith",
      "desc": "A Large spectral guardian appears and hovers for the duration in an unoccupied space of your choice that you can see within range. The guardian occupies that space and is indistinct except for a gleaming sword and shield emblazoned with the symbol of your deity.",
      "school": "Conjuration",
      "components": "['V']"
    },
    {
      "id": 145,
      "name": "Guards and Wards",
      "desc": "You create a ward that protects up to 2,500 square feet of floor space (an area 50 feet square, or one hundred 5-foot squares or twenty-five 10-foot squares). The warded area can be up to 20 feet tall, and shaped as you desire. You can ward several stories of a stronghold by dividing the area among them, as long as you can walk into each contiguous area while you are casting the spell.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 146,
      "name": "Guidance",
      "desc": "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends.",
      "school": "Divination",
      "components": "['V', 'S']"
    },
    {
      "id": 147,
      "name": "Guiding Bolt",
      "desc": "A flash of light streaks toward a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 4d6 radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 148,
      "name": "Gust of Wind",
      "desc": "A line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the spell's duration. Each creature that starts its turn in the line must succeed on a strength saving throw or be pushed 15 feet away from you in a direction following the line.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 149,
      "name": "Hallow",
      "desc": "You touch a point and infuse an area around it with holy (or unholy) power. The area can have a radius up to 60 feet, and the spell fails if the radius includes an area already under the effect a hallow spell. The affected area is subject to the following effects.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 150,
      "name": "Hallucinatory Terrain",
      "desc": "You make natural terrain in a 150-foot cube in range look, sound, and smell like some other sort of natural terrain. Thus, open fields or a road can be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road. Manufactured structures, equipment, and creatures within the area aren't changed in appearance.",
      "school": "Illusion",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 151,
      "name": "Harm",
      "desc": "You unleash a virulent disease on a creature that you can see within range. The target must make a constitution saving throw. On a failed save, it takes 14d6 necrotic damage, or half as much damage on a successful save. The damage can't reduce the target's hit points below 1. If the target fails the saving throw, its hit point maximum is reduced for 1 hour by an amount equal to the necrotic damage it took. Any effect that removes a disease allows a creature's hit point maximum to return to normal before that time passes.",
      "school": "Necromancy",
      "components": "['V', 'S']"
    },
    {
      "id": 152,
      "name": "Haste",
      "desc": "Choose a willing creature that you can see within range. Until the spell ends, the target's speed is doubled, it gains a +2 bonus to AC, it has advantage on dexterity saving throws, and it gains an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 153,
      "name": "Heal",
      "desc": "Choose a creature that you can see within range. A surge of positive energy washes through the creature, causing it to regain 70 hit points. This spell also ends blindness, deafness, and any diseases affecting the target. This spell has no effect on constructs or undead.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 154,
      "name": "Healing Word",
      "desc": "A creature of your choice that you can see within range regains hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs.",
      "school": "Evocation",
      "components": "['V']"
    },
    {
      "id": 155,
      "name": "Heat Metal",
      "desc": "Choose a manufactured metal object, such as a metal weapon or a suit of heavy or medium metal armor, that you can see within range. You cause the object to glow red-hot. Any creature in physical contact with the object takes 2d8 fire damage when you cast the spell. Until the spell ends, you can use a bonus action on each of your subsequent turns to cause this damage again.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 156,
      "name": "Hellish Rebuke",
      "desc": "You point your finger, and the creature that damaged you is momentarily surrounded by hellish flames. The creature must make a dexterity saving throw. It takes 2d10 fire damage on a failed save, or half as much damage on a successful one.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 157,
      "name": "Heroes' Feast",
      "desc": "You bring forth a great feast, including magnificent food and drink. The feast takes 1 hour to consume and disappears at the end of that time, and the beneficial effects don't set in until this hour is over. Up to twelve other creatures can partake of the feast.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 158,
      "name": "Heroism",
      "desc": "A willing creature you touch is imbued with bravery. Until the spell ends, the creature is immune to being frightened and gains temporary hit points equal to your spellcasting ability modifier at the start of each of its turns. When the spell ends, the target loses any remaining temporary hit points from this spell.",
      "school": "Enchantment",
      "components": "['V', 'S']"
    },
    {
      "id": 159,
      "name": "Hideous Laughter",
      "desc": "A creature of your choice that you can see within range perceives everything as hilariously funny and falls into fits of laughter if this spell affects it. The target must succeed on a wisdom saving throw or fall prone, becoming incapacitated and unable to stand up for the duration. A creature with an Intelligence score of 4 or less isn't affected.",
      "school": "Enchantment",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 160,
      "name": "Hold Monster",
      "desc": "Choose a creature you can see and reach. The target must make a saving throw of Wisdom or be paralyzed for the duration of the spell. This spell has no effect against the undead. At the end of each round, the target can make a new saving throw of Wisdom. If successful, the spell ends for the creature.",
      "school": "Enchantment",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 161,
      "name": "Hold Person",
      "desc": "Choose a humanoid that you can see within range. The target must succeed on a wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another wisdom saving throw. On a success, the spell ends on the target.",
      "school": "Enchantment",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 162,
      "name": "Holy Aura",
      "desc": "Divine light washes out from you and coalesces in a soft radiance in a 30-foot radius around you. Creatures of your choice in that radius when you cast this spell shed dim light in a 5-foot radius and have advantage on all saving throws, and other creatures have disadvantage on attack rolls against them until the spell ends. In addition, when a fiend or an undead hits an affected creature with a melee attack, the aura flashes with brilliant light. The attacker must succeed on a constitution saving throw or be blinded until the spell ends.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 163,
      "name": "Hunter's Mark",
      "desc": "You choose a creature you can see within range and mystically mark it as your quarry. Until the spell ends, you deal an extra 1d6 damage to the target whenever you hit it with a weapon attack, and you have advantage on any Wisdom (Perception) or Wisdom (Survival) check you make to find it. If the target drops to 0 hit points before this spell ends, you can use a bonus action on a subsequent turn of yours to mark a new creature.",
      "school": "Divination",
      "components": "['V']"
    },
    {
      "id": 164,
      "name": "Hypnotic Pattern",
      "desc": "You create a twisting pattern of colors that weaves through the air inside a 30-foot cube within range. The pattern appears for a moment and vanishes. Each creature in the area who sees the pattern must make a wisdom saving throw. On a failed save, the creature becomes charmed for the duration. While charmed by this spell, the creature is incapacitated and has a speed of 0.",
      "school": "Illusion",
      "components": "['S', 'M']"
    },
    {
      "id": 165,
      "name": "Ice Storm",
      "desc": "A hail of rock-hard ice pounds to the ground in a 20-foot-radius, 40-foot-high cylinder centered on a point within range. Each creature in the cylinder must make a dexterity saving throw. A creature takes 2d8 bludgeoning damage and 4d6 cold damage on a failed save, or half as much damage on a successful one.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 166,
      "name": "Identify",
      "desc": "You choose one object that you must touch throughout the casting of the spell. If it is a magic item or some other magic-imbued object, you learn its properties and how to use them, whether it requires attunement to use, and how many charges it has, if any. You learn whether any spells are affecting the item and what they are. If the item was created by a spell, you learn which spell created it.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 167,
      "name": "Illusory Script",
      "desc": "You write on parchment, paper, or some other suitable writing material and imbue it with a potent illusion that lasts for the duration.",
      "school": "Illusion",
      "components": "['S', 'M']"
    },
    {
      "id": 168,
      "name": "Imprisonment",
      "desc": "You create a magical restraint to hold a creature that you can see within range. The target must succeed on a wisdom saving throw or be bound by the spell; if it succeeds, it is immune to this spell if you cast it again. While affected by this spell, the creature doesn't need to breathe, eat, or drink, and it doesn't age. Divination spells can't locate or perceive the target.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 169,
      "name": "Incendiary Cloud",
      "desc": "A swirling cloud of smoke shot through with white-hot embers appears in a 20-foot-radius sphere centered on a point within range. The cloud spreads around corners and is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 170,
      "name": "Inflict Wounds",
      "desc": "Make a melee spell attack against a creature you can reach. On a hit, the target takes 3d10 necrotic damage.",
      "school": "Necromancy",
      "components": "['V', 'S']"
    },
    {
      "id": 171,
      "name": "Insect Plague",
      "desc": "Swarming, biting locusts fill a 20-foot-radius sphere centered on a point you choose within range. The sphere spreads around corners. The sphere remains for the duration, and its area is lightly obscured. The sphere's area is difficult terrain.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 172,
      "name": "Instant Summons",
      "desc": "You touch an object weighing 10 pounds or less whose longest dimension is 6 feet or less. The spell leaves an invisible mark on its surface and invisibly inscribes the name of the item on the sapphire you use as the material component. Each time you cast this spell, you must use a different sapphire.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 173,
      "name": "Invisibility",
      "desc": "A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person. The spell ends for a target that attacks or casts a spell.",
      "school": "Illusion",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 174,
      "name": "Irresistible Dance",
      "desc": "Choose one creature that you can see within range. The target begins a comic dance in place: shuffling, tapping its feet, and capering for the duration. Creatures that can't be charmed are immune to this spell.",
      "school": "Enchantment",
      "components": "['V']"
    },
    {
      "id": 175,
      "name": "Jump",
      "desc": "You touch a creature. The creature's jump distance is tripled until the spell ends.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 176,
      "name": "Knock",
      "desc": "Choose an object that you can see within range. The object can be a door, a box, a chest, a set of manacles, a padlock, or another object that contains a mundane or magical means that prevents access.",
      "school": "Transmutation",
      "components": "['V']"
    },
    {
      "id": 177,
      "name": "Legend Lore",
      "desc": "Name or describe a person, place, or object. The spell brings to your mind a brief summary of the significant lore about the thing you named. The lore might consist of current tales, forgotten stories, or even secret lore that has never been widely known. If the thing you named isn't of legendary importance, you gain no information. The more information you already have about the thing, the more precise and detailed the information you receive is.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 178,
      "name": "Lesser Restoration",
      "desc": "You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned.",
      "school": "Abjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 179,
      "name": "Levitate",
      "desc": "One creature or object of your choice that you can see within range rises vertically, up to 20 feet, and remains suspended there for the duration. The spell can levitate a target that weighs up to 500 pounds. An unwilling creature that succeeds on a constitution saving throw is unaffected.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 180,
      "name": "Light",
      "desc": "You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet. The light can be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action.",
      "school": "Evocation",
      "components": "['V', 'M']"
    },
    {
      "id": 181,
      "name": "Lightning Bolt",
      "desc": "A stroke of lightning forming a line 100 feet long and 5 feet wide blasts out from you in a direction you choose. Each creature in the line must make a dexterity saving throw. A creature takes 8d6 lightning damage on a failed save, or half as much damage on a successful one.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 182,
      "name": "Locate Animals or Plants",
      "desc": "Describe or name a specific kind of beast or plant. Concentrating on the voice of nature in your surroundings, you learn the direction and distance to the closest creature or plant of that kind within 5 miles, if any are present.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 183,
      "name": "Locate Creature",
      "desc": "Describe or name a creature that is familiar to you. You sense the direction to the creature's location, as long as that creature is within 1,000 feet of you. If the creature is moving, you know the direction of its movement.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 184,
      "name": "Locate Object",
      "desc": "Describe or name an object that is familiar to you. You sense the direction to the object's location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 185,
      "name": "Longstrider",
      "desc": "You touch a creature. The target's speed increases by 10 feet until the spell ends.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 186,
      "name": "Mage Armor",
      "desc": "You touch a willing creature who isn't wearing armor, and a protective magical force surrounds it until the spell ends. The target's base AC becomes 13 + its Dexterity modifier. The spell ends if the target dons armor or if you dismiss the spell as an action.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 187,
      "name": "Mage Hand",
      "desc": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 188,
      "name": "Magic Circle",
      "desc": "You create a 10-foot radius, 20-foot-tall cylinder of magical energy centered on a point on the ground that you can see within range. Glowing runes appear whenever the cylinder intersects with the floor or other surface.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 189,
      "name": "Magic Jar",
      "desc": "Your body falls into a catatonic state as your soul leaves it and enters the container you used for the spell's material component. While your soul inhabits the container, you are aware of your surroundings as if you were in the container's space. You can't move or use reactions. The only action you can take is to project your soul up to 100 feet out of the container, either returning to your living body (and ending the spell) or attempting to possess a humanoids body.",
      "school": "Necromancy",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 190,
      "name": "Magic Missile",
      "desc": "You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals 1d4 + 1 force damage to its target. The darts all strike simultaneously, and you can direct them to hit one creature or several.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 191,
      "name": "Magic Mouth",
      "desc": "You plant a message to an object in the range of the spell. The message is verbalized when the trigger conditions are met. Choose an object that you see, and that is not worn or carried by another creature. Then say the message, which should not exceed 25 words but listening can take up to 10 minutes. Finally, establish the circumstances that trigger the spell to deliver your message.",
      "school": "Illusion",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 192,
      "name": "Magic Weapon",
      "desc": "You touch a nonmagical weapon. Until the spell ends, that weapon becomes a magic weapon with a +1 bonus to attack rolls and damage rolls.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 193,
      "name": "Magnificent Mansion",
      "desc": "You conjure an extradimensional dwelling in range that lasts for the duration. You choose where its one entrance is located. The entrance shimmers faintly and is 5 feet wide and 10 feet tall. You and any creature you designate when you cast the spell can enter the extradimensional dwelling as long as the portal remains open. You can open or close the portal if you are within 30 feet of it. While closed, the portal is invisible.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 194,
      "name": "Major Image",
      "desc": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can't create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte's stench).",
      "school": "Illusion",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 195,
      "name": "Mass Cure Wounds",
      "desc": "A wave of healing energy washes out from a point of your choice within range. Choose up to six creatures in a 30-foot-radius sphere centered on that point. Each target regains hit points equal to 3d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 196,
      "name": "Mass Heal",
      "desc": "A flood of healing energy flows from you into injured creatures around you. You restore up to 700 hit points, divided as you choose among any number of creatures that you can see within range. Creatures healed by this spell are also cured of all diseases and any effect making them blinded or deafened. This spell has no effect on undead or constructs.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 197,
      "name": "Mass Healing Word",
      "desc": "As you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs.",
      "school": "Evocation",
      "components": "['V']"
    },
    {
      "id": 198,
      "name": "Mass Suggestion",
      "desc": "You suggest a course of activity (limited to a sentence or two) and magically influence up to twelve creatures of your choice that you can see within range and that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act automatically negates the effect of the spell.",
      "school": "Enchantment",
      "components": "['V', 'M']"
    },
    {
      "id": 199,
      "name": "Maze",
      "desc": "You banish a creature that you can see within range into a labyrinthine demiplane. The target remains there for the duration or until it escapes the maze.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 200,
      "name": "Meld Into Stone",
      "desc": "You step into a stone object or surface large enough to fully contain your body, melding yourself and all the equipment you carry with the stone for the duration. Using your movement, you step into the stone at a point you can touch. Nothing of your presence remains visible or otherwise detectable by nonmagical senses.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 201,
      "name": "Mending",
      "desc": "This spell repairs a single break or tear in an object you touch, such as a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no longer than 1 foot in any dimension, you mend it, leaving no trace of the former damage.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 202,
      "name": "Message",
      "desc": "You point your finger toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 203,
      "name": "Meteor Swarm",
      "desc": "Blazing orbs of fire plummet to the ground at four different points you can see within range. Each creature in a 40-foot-radius sphere centered on each point you choose must make a dexterity saving throw. The sphere spreads around corners. A creature takes 20d6 fire damage and 20d6 bludgeoning damage on a failed save, or half as much damage on a successful one. A creature in the area of more than one fiery burst is affected only once.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 204,
      "name": "Mind Blank",
      "desc": "Until the spell ends, one willing creature you touch is immune to psychic damage, any effect that would sense its emotions or read its thoughts, divination spells, and the charmed condition. The spell even foils wish spells and spells or effects of similar power used to affect the target's mind or to gain information about the target.",
      "school": "Abjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 205,
      "name": "Minor Illusion",
      "desc": "You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again.",
      "school": "Illusion",
      "components": "['S', 'M']"
    },
    {
      "id": 206,
      "name": "Mirage Arcane",
      "desc": "You make terrain in an area up to 1 mile square look, sound, smell, and even feel like some other sort of terrain. The terrain's general shape remains the same, however. Open fields or a road could be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road.",
      "school": "Illusion",
      "components": "['V', 'S']"
    },
    {
      "id": 207,
      "name": "Mirror Image",
      "desc": "Three illusory duplicates of yourself appear in your space. Until the spell ends, the duplicates move with you and mimic your actions, shifting position so it's impossible to track which image is real. You can use your action to dismiss the illusory duplicates.",
      "school": "Illusion",
      "components": "['V', 'S']"
    },
    {
      "id": 208,
      "name": "Mislead",
      "desc": "You become invisible at the same time that an illusory double of you appears where you are standing. The double lasts for the duration, but the invisibility ends if you attack or cast a spell.",
      "school": "Illusion",
      "components": "['S']"
    },
    {
      "id": 209,
      "name": "Misty Step",
      "desc": "Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see.",
      "school": "Conjuration",
      "components": "['V']"
    },
    {
      "id": 210,
      "name": "Modify Memory",
      "desc": "You attempt to reshape another creature's memories. One creature that you can see must make a wisdom saving throw. If you are fighting the creature, it has advantage on the saving throw. On a failed save, the target becomes charmed by you for the duration. The charmed target is incapacitated and unaware of its surroundings, though it can still hear you. If it takes any damage or is targeted by another spell, this spell ends, and none of the target's memories are modified.",
      "school": "Enchantment",
      "components": "['V', 'S']"
    },
    {
      "id": 211,
      "name": "Moonbeam",
      "desc": "A silvery beam of pale light shines down in a 5-foot radius, 40-foot-high cylinder centered on a point within range. Until the spell ends, dim light fills the cylinder.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 212,
      "name": "Move Earth",
      "desc": "Choose an area of terrain no larger than 40 feet on a side within range. You can reshape dirt, sand, or clay in the area in any manner you choose for the duration. You can raise or lower the area's elevation, create or fill in a trench, erect or flatten a wall, or form a pillar. The extent of any such changes can't exceed half the area's largest dimension. So, if you affect a 40-foot square, you can create a pillar up to 20 feet high, raise or lower the square's elevation by up to 20 feet, dig a trench up to 20 feet deep, and so on. It takes 10 minutes for these changes to complete.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 213,
      "name": "Nondetection",
      "desc": "For the duration, you hide a target that you touch from divination magic. The target can be a willing creature or a place or an object no larger than 10 feet in any dimension. The target can't be targeted by any divination magic or perceived through magical scrying sensors.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 214,
      "name": "Pass Without Trace",
      "desc": "A veil of shadows and silence radiates from you, masking you and your companions from detection. For the duration, each creature you choose within 30 feet of you (including you) has a +10 bonus to Dexterity (Stealth) checks and can't be tracked except by magical means. A creature that receives this bonus leaves behind no tracks or other traces of its passage.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 215,
      "name": "Passwall",
      "desc": "A passage appears at a point of your choice that you can see on a wooden, plaster, or stone surface (such as a wall, a ceiling, or a floor) within range, and lasts for the duration. You choose the opening's dimensions: up to 5 feet wide, 8 feet tall, and 20 feet deep. The passage creates no instability in a structure surrounding it.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 216,
      "name": "Phantasmal Killer",
      "desc": "You tap into the nightmares of a creature you can see within range and create an illusory manifestation of its deepest fears, visible only to that creature. The target must make a wisdom saving throw. On a failed save, the target becomes frightened for the duration. At the start of each of the target's turns before the spell ends, the target must succeed on a wisdom saving throw or take 4d10 psychic damage. On a successful save, the spell ends.",
      "school": "Illusion",
      "components": "['V', 'S']"
    },
    {
      "id": 217,
      "name": "Phantom Steed",
      "desc": "A Large quasi-real, horselike creature appears on the ground in an unoccupied space of your choice within range. You decide the creature's appearance, but it is equipped with a saddle, bit, and bridle. Any of the equipment created by the spell vanishes in a puff of smoke if it is carried more than 10 feet away from the steed.",
      "school": "Illusion",
      "components": "['V', 'S']"
    },
    {
      "id": 218,
      "name": "Planar Ally",
      "desc": "You beseech an otherworldly entity for aid. The being must be known to you: a god, a primordial, a demon prince, or some other being of cosmic power. That entity sends a celestial, an elemental, or a fiend loyal to it to aid you, making the creature appear in an unoccupied space within range. If you know a specific creature's name, you can speak that name when you cast this spell to request that creature, though you might get a different creature anyway (GM's choice).",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 219,
      "name": "Planar Binding",
      "desc": "With this spell, you attempt to bind a celestial, an elemental, a fey, or a fiend to your service. The creature must be within range for the entire casting of the spell. (Typically, the creature is first summoned into the center of an inverted magic circle in order to keep it trapped while this spell is cast.) At the completion of the casting, the target must make a charisma saving throw. On a failed save, it is bound to serve you for the duration. If the creature was summoned or created by another spell, that spell's duration is extended to match the duration of this spell.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 220,
      "name": "Plane Shift",
      "desc": "You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the City of Brass on the Elemental Plane of Fire or the palace of Dispater on the second level of the Nine Hells, and you appear in or near that destination. If you are trying to reach the City of Brass, for example, you might arrive in its Street of Steel, before its Gate of Ashes, or looking at the city from across the Sea of Fire, at the GM's discretion.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 221,
      "name": "Plant Growth",
      "desc": "This spell channels vitality into plants within a specific area. There are two possible uses for the spell, granting either immediate or long-term benefits.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 222,
      "name": "Poison Spray",
      "desc": "You extend your hand toward a creature you can see within range and project a puff of noxious gas from your palm. The creature must succeed on a constitution saving throw or take 1d12 poison damage.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 223,
      "name": "Polymorph",
      "desc": "This spell transforms a creature that you can see within range into a new form. An unwilling creature must make a wisdom saving throw to avoid the effect. A shapechanger automatically succeeds on this saving throw.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 224,
      "name": "Power Word Kill",
      "desc": "You utter a word of power that can compel one creature you can see within range to die instantly. If the creature you choose has 100 hit points or fewer, it dies. Otherwise, the spell has no effect.",
      "school": "Enchantment",
      "components": "['V']"
    },
    {
      "id": 225,
      "name": "Power Word Stun",
      "desc": "You speak a word of power that can overwhelm the mind of one creature you can see within range, leaving it dumbfounded. If the target has 150 hit points or fewer, it is stunned. Otherwise, the spell has no effect.",
      "school": "Enchantment",
      "components": "['V']"
    },
    {
      "id": 226,
      "name": "Prayer of Healing",
      "desc": "Up to six creatures of your choice that you can see within range each regain hit points equal to 2d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs.",
      "school": "Evocation",
      "components": "['V']"
    },
    {
      "id": 227,
      "name": "Prestidigitation",
      "desc": "This spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical effects within 'range':",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 228,
      "name": "Prismatic Spray",
      "desc": "Eight multicolored rays of light flash from your hand. Each ray is a different color and has a different power and purpose. Each creature in a 60-foot cone must make a dexterity saving throw. For each target, roll a d8 to determine which color ray affects it.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 229,
      "name": "Prismatic Wall",
      "desc": "A shimmering, multicolored plane of light forms a vertical opaque wall--up to 90 feet long, 30 feet high, and 1 inch thick--centered on a point you can see within range. Alternatively, you can shape the wall into a sphere up to 30 feet in diameter centered on a point you choose within range. The wall remains in place for the duration. If you position the wall so that it passes through a space occupied by a creature, the spell fails, and your action and the spell slot are wasted.",
      "school": "Abjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 230,
      "name": "Private Sanctum",
      "desc": "You make an area within range magically secure. The area is a cube that can be as small as 5 feet to as large as 100 feet on each side. The spell lasts for the duration or until you use an action to dismiss it.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 231,
      "name": "Produce Flame",
      "desc": "A flickering flame appears in your hand. The flame remains there for the duration and harms neither you nor your equipment. The flame sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The spell ends if you dismiss it as an action or if you cast it again.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 232,
      "name": "Programmed Illusion",
      "desc": "You create an illusion of an object, a creature, or some other visible phenomenon within range that activates when a specific condition occurs. The illusion is imperceptible until then. It must be no larger than a 30-foot cube, and you decide when you cast the spell how the illusion behaves and what sounds it makes. This scripted performance can last up to 5 minutes.",
      "school": "Illusion",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 233,
      "name": "Project Image",
      "desc": "You create an illusory copy of yourself that lasts for the duration. The copy can appear at any location within range that you have seen before, regardless of intervening obstacles. The illusion looks and sounds like you but is intangible. If the illusion takes any damage, it disappears, and the spell ends.",
      "school": "Illusion",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 234,
      "name": "Protection From Energy",
      "desc": "For the duration, the willing creature you touch has resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder.",
      "school": "Abjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 235,
      "name": "Protection from Evil and Good",
      "desc": "Until the spell ends, one willing creature you touch is protected against certain types of creatures: aberrations, celestials, elementals, fey, fiends, and undead.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 236,
      "name": "Protection from Poison",
      "desc": "You touch a creature. If it is poisoned, you neutralize the poison. If more than one poison afflicts the target, you neutralize one poison that you know is present, or you neutralize one at random.",
      "school": "Abjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 237,
      "name": "Purify Food and Drink",
      "desc": "All nonmagical food and drink within a 5-foot radius sphere centered on a point of your choice within range is purified and rendered free of poison and disease.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 238,
      "name": "Raise Dead",
      "desc": "You return a dead creature you touch to life, provided that it has been dead no longer than 10 days. If the creature's soul is both willing and at liberty to rejoin the body, the creature returns to life with 1 hit point.",
      "school": "Necromancy",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 239,
      "name": "Ray of Enfeeblement",
      "desc": "A black beam of enervating energy springs from your finger toward a creature within range. Make a ranged spell attack against the target. On a hit, the target deals only half damage with weapon attacks that use Strength until the spell ends.",
      "school": "Necromancy",
      "components": "['V', 'S']"
    },
    {
      "id": 240,
      "name": "Ray of Frost",
      "desc": "A frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 241,
      "name": "Regenerate",
      "desc": "You touch a creature and stimulate its natural healing ability. The target regains 4d8 + 15 hit points. For the duration of the spell, the target regains 1 hit point at the start of each of its turns (10 hit points each minute).",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 242,
      "name": "Reincarnate",
      "desc": "You touch a dead humanoid or a piece of a dead humanoid. Provided that the creature has been dead no longer than 10 days, the spell forms a new adult body for it and then calls the soul to enter that body. If the target's soul isn't free or willing to do so, the spell fails.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 243,
      "name": "Remove Curse",
      "desc": "At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner's attunement to the object so it can be removed or discarded.",
      "school": "Abjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 244,
      "name": "Resilient Sphere",
      "desc": "A sphere of shimmering force encloses a creature or object of Large size or smaller within range. An unwilling creature must make a dexterity saving throw. On a failed save, the creature is enclosed for the duration.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 245,
      "name": "Resistance",
      "desc": "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one saving throw of its choice. It can roll the die before or after making the saving throw. The spell then ends.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 246,
      "name": "Resurrection",
      "desc": "You touch a dead creature that has been dead for no more than a century, that didn't die of old age, and that isn't undead. If its soul is free and willing, the target returns to life with all its hit points.",
      "school": "Necromancy",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 247,
      "name": "Reverse Gravity",
      "desc": "This spell reverses gravity in a 50-foot-radius, 100-foot high cylinder centered on a point within range. All creatures and objects that aren't somehow anchored to the ground in the area fall upward and reach the top of the area when you cast this spell. A creature can make a dexterity saving throw to grab onto a fixed object it can reach, thus avoiding the fall.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 248,
      "name": "Revivify",
      "desc": "You touch a creature that has died within the last minute. That creature returns to life with 1 hit point. This spell can't return to life a creature that has died of old age, nor can it restore any missing body parts.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 249,
      "name": "Rope Trick",
      "desc": "You touch a length of rope that is up to 60 feet long. One end of the rope then rises into the air until the whole rope hangs perpendicular to the ground. At the upper end of the rope, an invisible entrance opens to an extradimensional space that lasts until the spell ends.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 250,
      "name": "Sacred Flame",
      "desc": "Flame-like radiance descends on a creature that you can see within range. The target must succeed on a dexterity saving throw or take 1d8 radiant damage. The target gains no benefit from cover for this saving throw.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 251,
      "name": "Sanctuary",
      "desc": "You ward a creature within range against attack. Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn't protect the warded creature from area effects, such as the explosion of a fireball.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 252,
      "name": "Scorching Ray",
      "desc": "You create three rays of fire and hurl them at targets within range. You can hurl them at one target or several.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 253,
      "name": "Scrying",
      "desc": "You can see and hear a particular creature you choose that is on the same plane of existence as you. The target must make a wisdom saving throw, which is modified by how well you know the target and the sort of physical connection you have to it. If a target knows you're casting this spell, it can fail the saving throw voluntarily if it wants to be observed.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 254,
      "name": "Secret Chest",
      "desc": "You hide a chest, and all its contents, on the Ethereal Plane. You must touch the chest and the miniature replica that serves as a material component for the spell. The chest can contain up to 12 cubic feet of nonliving material (3 feet by 2 feet by 2 feet).",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 255,
      "name": "See Invisibility",
      "desc": "For the duration of the spell, you see invisible creatures and objects as if they were visible, and you can see through Ethereal. The ethereal objects and creatures appear ghostly translucent.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 256,
      "name": "Seeming",
      "desc": "This spell allows you to change the appearance of any number of creatures that you can see within range. You give each target you choose a new, illusory appearance. An unwilling target can make a charisma saving throw, and if it succeeds, it is unaffected by this spell.",
      "school": "Illusion",
      "components": "['V', 'S']"
    },
    {
      "id": 257,
      "name": "Sending",
      "desc": "You send a short message of twenty-five words or less to a creature with which you are familiar. The creature hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately. The spell enables creatures with Intelligence scores of at least 1 to understand the meaning of your message.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 258,
      "name": "Sequester",
      "desc": "By means of this spell, a willing creature or an object can be hidden away, safe from detection for the duration. When you cast the spell and touch the target, it becomes invisible and can't be targeted by divination spells or perceived through scrying sensors created by divination spells.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 259,
      "name": "Shapechange",
      "desc": "You assume the form of a different creature for the duration. The new form can be of any creature with a challenge rating equal to your level or lower. The creature can't be a construct or an undead, and you must have seen the sort of creature at least once. You transform into an average example of that creature, one without any class levels or the Spellcasting trait.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 260,
      "name": "Shatter",
      "desc": "A sudden loud ringing noise, painfully intense, erupts from a point of your choice within range. Each creature in a 10-foot-radius sphere centered on that point must make a Constitution saving throw. A creature takes 3d8 thunder damage on a failed save, or half as much damage on a successful one. A creature made of inorganic material such as stone, crystal, or metal has disadvantage on this saving throw.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 261,
      "name": "Shield",
      "desc": "An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile.",
      "school": "Abjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 262,
      "name": "Shield of Faith",
      "desc": "A shimmering field appears and surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 263,
      "name": "Shillelagh",
      "desc": "The wood of a club or a quarterstaff you are holding is imbued with nature's power. For the duration, you can use your spellcasting ability instead of Strength for the attack and damage rolls of melee attacks using that weapon, and the weapon's damage die becomes a d8. The weapon also becomes magical, if it isn't already. The spell ends if you cast it again or if you let go of the weapon.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 264,
      "name": "Shocking Grasp",
      "desc": "Lightning springs from your hand to deliver a shock to a creature you try to touch. Make a melee spell attack against the target. You have advantage on the attack roll if the target is wearing armor made of metal. On a hit, the target takes 1d8 lightning damage, and it can't take reactions until the start of its next turn.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 265,
      "name": "Silence",
      "desc": "For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it.",
      "school": "Illusion",
      "components": "['V', 'S']"
    },
    {
      "id": 266,
      "name": "Silent Image",
      "desc": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 15-foot cube. The image appears at a spot within range and lasts for the duration. The image is purely visual; it isn't accompanied by sound, smell, or other sensory effects.",
      "school": "Illusion",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 267,
      "name": "Simulacrum",
      "desc": "You shape an illusory duplicate of one beast or humanoid that is within range for the entire casting time of the spell. The duplicate is a creature, partially real and formed from ice or snow, and it can take actions and otherwise be affected as a normal creature. It appears to be the same as the original, but it has half the creature's hit point maximum and is formed without any equipment. Otherwise, the illusion uses all the statistics of the creature it duplicates.",
      "school": "Illusion",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 268,
      "name": "Sleep",
      "desc": "This spell sends creatures into a magical slumber. Roll 5d8; the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures).",
      "school": "Enchantment",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 269,
      "name": "Sleet Storm",
      "desc": "Until the spell ends, freezing rain and sleet fall in a 20-foot-tall cylinder with a 40-foot radius centered on a point you choose within range. The area is heavily obscured, and exposed flames in the area are doused.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 270,
      "name": "Slow",
      "desc": "You alter time around up to six creatures of your choice in a 40-foot cube within range. Each target must succeed on a wisdom saving throw or be affected by this spell for the duration.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 271,
      "name": "Spare the Dying",
      "desc": "You touch a living creature that has 0 hit points. The creature becomes stable. This spell has no effect on undead or constructs.",
      "school": "Necromancy",
      "components": "['V', 'S']"
    },
    {
      "id": 272,
      "name": "Speak with Animals",
      "desc": "You gain the ability to comprehend and verbally communicate with beasts for the duration. The knowledge and awareness of many beasts is limited by their intelligence, but at a minimum, beasts can give you information about nearby locations and monsters, including whatever they can perceive or have perceived within the past day. You might be able to persuade a beast to perform a small favor for you, at the GM's discretion.",
      "school": "Divination",
      "components": "['V', 'S']"
    },
    {
      "id": 273,
      "name": "Speak with Dead",
      "desc": "You grant the semblance of life and intelligence to a corpse of your choice within range, allowing it to answer the questions you pose. The corpse must still have a mouth and can't be undead. The spell fails if the corpse was the target of this spell within the last 10 days.",
      "school": "Necromancy",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 274,
      "name": "Speak with Plants",
      "desc": "You imbue plants within 30 feet of you with limited sentience and animation, giving them the ability to communicate with you and follow your simple commands. You can question plants about events in the spell's area within the past day, gaining information about creatures that have passed, weather, and other circumstances.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 275,
      "name": "Spider Climb",
      "desc": "Until the spell ends, one willing creature you touch gains the ability to move up, down, and across vertical surfaces and upside down along ceilings, while leaving its hands free. The target also gains a climbing speed equal to its walking speed.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 276,
      "name": "Spike Growth",
      "desc": "The ground in a 20-foot radius centered on a point within range twists and sprouts hard spikes and thorns. The area becomes difficult terrain for the duration. When a creature moves into or within the area, it takes 2d4 piercing damage for every 5 feet it travels.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 277,
      "name": "Spirit Guardians",
      "desc": "You call forth spirits to protect you. They flit around you to a distance of 15 feet for the duration. If you are good or neutral, their spectral form appears angelic or fey (your choice). If you are evil, they appear fiendish.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 278,
      "name": "Spiritual Weapon",
      "desc": "You create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again. When you cast the spell, you can make a melee spell attack against a creature within 5 feet of the weapon. On a hit, the target takes force damage equal to 1d8 + your spellcasting ability modifier.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 279,
      "name": "Stinking Cloud",
      "desc": "You create a 20-foot-radius sphere of yellow, nauseating gas centered on a point within range. The cloud spreads around corners, and its area is heavily obscured. The cloud lingers in the air for the duration.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 280,
      "name": "Stone Shape",
      "desc": "You touch a stone object of Medium size or smaller or a section of stone no more than 5 feet in any dimension and form it into any shape that suits your purpose. So, for example, you could shape a large rock into a weapon, idol, or coffer, or make a small passage through a wall, as long as the wall is less than 5 feet thick. You could also shape a stone door or its frame to seal the door shut. The object you create can have up to two hinges and a latch, but finer mechanical detail isn't possible.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 281,
      "name": "Stoneskin",
      "desc": "This spell turns the flesh of a willing creature you touch as hard as stone. Until the spell ends, the target has resistance to nonmagical bludgeoning, piercing, and slashing damage.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 282,
      "name": "Storm of Vengeance",
      "desc": "A churning storm cloud forms, centered on a point you can see and spreading to a radius of 360 feet. Lightning flashes in the area, thunder booms, and strong winds roar. Each creature under the cloud (no more than 5,000 feet beneath the cloud) when it appears must make a constitution saving throw. On a failed save, a creature takes 2d6 thunder damage and becomes deafened for 5 minutes.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 283,
      "name": "Suggestion",
      "desc": "You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell.",
      "school": "Enchantment",
      "components": "['V', 'M']"
    },
    {
      "id": 284,
      "name": "Sunbeam",
      "desc": "A beam of brilliant light flashes out from your hand in a 5-foot-wide, 60-foot-long line. Each creature in the line must make a constitution saving throw. On a failed save, a creature takes 6d8 radiant damage and is blinded until your next turn. On a successful save, it takes half as much damage and isn't blinded by this spell. Undead and oozes have disadvantage on this saving throw.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 285,
      "name": "Sunburst",
      "desc": "Brilliant sunlight flashes in a 60-foot radius centered on a point you choose within range. Each creature in that light must make a constitution saving throw. On a failed save, a creature takes 12d6 radiant damage and is blinded for 1 minute. On a successful save, it takes half as much damage and isn't blinded by this spell. Undead and oozes have disadvantage on this saving throw.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 286,
      "name": "Symbol",
      "desc": "When you cast this spell, you inscribe a harmful glyph either on a surface (such as a section of floor, a wall, or a table) or within an object that can be closed to conceal the glyph (such as a book, a scroll, or a treasure chest). If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 287,
      "name": "Telekinesis",
      "desc": "You gain the ability to move or manipulate creatures or objects by thought. When you cast the spell, and as your action each round for the duration, you can exert your will on one creature or object that you can see within range, causing the appropriate effect below. You can affect the same target round after round, or choose a new one at any time. If you switch targets, the prior target is no longer affected by the spell.",
      "school": "Transmutation",
      "components": "['V', 'S']"
    },
    {
      "id": 288,
      "name": "Telepathic Bond",
      "desc": "You forge a telepathic link among up to eight willing creatures of your choice within range, psychically linking each creature to all the others for the duration. Creatures with Intelligence scores of 2 or less aren't affected by this spell.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 289,
      "name": "Teleport",
      "desc": "This spell instantly transports you and up to eight willing creatures of your choice that you can see within range, or a single object that you can see within range, to a destination you select. If you target an object, it must be able to fit entirely inside a 10-foot cube, and it can't be held or carried by an unwilling creature.",
      "school": "Conjuration",
      "components": "['V']"
    },
    {
      "id": 290,
      "name": "Teleportation Circle",
      "desc": "As you cast the spell, you draw a 10-foot-diameter circle on the ground inscribed with sigils that link your location to a permanent teleportation circle of your choice whose sigil sequence you know and that is on the same plane of existence as you. A shimmering portal opens within the circle you drew and remains open until the end of your next turn. Any creature that enters the portal instantly appears within 5 feet of the destination circle or in the nearest unoccupied space if that space is occupied.",
      "school": "Conjuration",
      "components": "['V', 'M']"
    },
    {
      "id": 291,
      "name": "Thaumaturgy",
      "desc": "You manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical effects within range.",
      "school": "Transmutation",
      "components": "['V']"
    },
    {
      "id": 292,
      "name": "Thunderwave",
      "desc": "A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed.",
      "school": "Evocation",
      "components": "['V', 'S']"
    },
    {
      "id": 293,
      "name": "Time Stop",
      "desc": "You briefly stop the flow of time for everyone but yourself. No time passes for other creatures, while you take 1d4 + 1 turns in a row, during which you can use actions and move as normal.",
      "school": "Transmutation",
      "components": "['V']"
    },
    {
      "id": 294,
      "name": "Tiny Hut",
      "desc": "A 10-foot-radius immobile dome of force springs into existence around and above you and remains stationary for the duration. The spell ends if you leave its area.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 295,
      "name": "Tongues",
      "desc": "This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says.",
      "school": "Divination",
      "components": "['V', 'M']"
    },
    {
      "id": 296,
      "name": "Transport via Plants",
      "desc": "This spell creates a magical link between a Large or larger inanimate plant within range and another plant, at any distance, on the same plane of existence. You must have seen or touched the destination plant at least once before. For the duration, any creature can step into the target plant and exit from the destination plant by using 5 feet of movement.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 297,
      "name": "Tree Stride",
      "desc": "You gain the ability to enter a tree and move from inside it to inside another tree of the same kind within 500 feet. Both trees must be living and at least the same size as you. You must use 5 feet of movement to enter a tree. You instantly know the location of all other trees of the same kind within 500 feet and, as part of the move used to enter the tree, can either pass into one of those trees or step out of the tree you're in. You appear in a spot of your choice within 5 feet of the destination tree, using another 5 feet of movement. If you have no movement left, you appear within 5 feet of the tree you entered.",
      "school": "Conjuration",
      "components": "['V', 'S']"
    },
    {
      "id": 298,
      "name": "True Polymorph",
      "desc": "Choose one creature or nonmagical object that you can see within range. You transform the creature into a different creature, the creature into an object, or the object into a creature (the object must be neither worn nor carried by another creature). The transformation lasts for the duration, or until the target drops to 0 hit points or dies. If you concentrate on this spell for the full duration, the transformation becomes permanent.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 299,
      "name": "True Resurrection",
      "desc": "You touch a creature that has been dead for no longer than 200 years and that died for any reason except old age. If the creature's soul is free and willing, the creature is restored to life with all its hit points.",
      "school": "Necromancy",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 300,
      "name": "True Seeing",
      "desc": "This spell gives the willing creature you touch the ability to see things as they actually are. For the duration, the creature has truesight, notices secret doors hidden by magic, and can see into the Ethereal Plane, all out to a range of 120 feet.",
      "school": "Divination",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 301,
      "name": "True Strike",
      "desc": "You extend your hand and point a finger at a target in range. Your magic grants you a brief insight into the target's defenses. On your next turn, you gain advantage on your first attack roll against the target, provided that this spell hasn't ended.",
      "school": "Divination",
      "components": "['S']"
    },
    {
      "id": 302,
      "name": "Unseen Servant",
      "desc": "This spell creates an invisible, mindless, shapeless force that performs simple tasks at your command until the spell ends. The servant springs into existence in an unoccupied space on the ground within range. It has AC 10, 1 hit point, and a Strength of 2, and it can't attack. If it drops to 0 hit points, the spell ends.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 303,
      "name": "Vampiric Touch",
      "desc": "The touch of your shadow-wreathed hand can siphon life force from others to heal your wounds. Make a melee spell attack against a creature within your reach. On a hit, the target takes 3d6 necrotic damage, and you regain hit points equal to half the amount of necrotic damage dealt. Until the spell ends, you can make the attack again on each of your turns as an action.",
      "school": "Necromancy",
      "components": "['V', 'S']"
    },
    {
      "id": 304,
      "name": "Vicious Mockery",
      "desc": "You unleash a string of insults laced with subtle enchantments at a creature you can see within range. If the target can hear you (though it need not understand you), it must succeed on a wisdom saving throw or take 1d4 psychic damage and have disadvantage on the next attack roll it makes before the end of its next turn.",
      "school": "Enchantment",
      "components": "['V']"
    },
    {
      "id": 305,
      "name": "Wall of Fire",
      "desc": "You create a wall of fire on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 306,
      "name": "Wall of Force",
      "desc": "An invisible wall of force springs into existence at a point you choose within range. The wall appears in any orientation you choose, as a horizontal or vertical barrier or at an angle. It can be free floating or resting on a solid surface. You can form it into a hemispherical dome or a sphere with a radius of up to 10 feet, or you can shape a flat surface made up of ten 10-foot-by-10-foot panels. Each panel must be contiguous with another panel. In any form, the wall is 1/4 inch thick. It lasts for the duration. If the wall cuts through a creature's space when it appears, the creature is pushed to one side of the wall (your choice which side).",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 307,
      "name": "Wall of Ice",
      "desc": "You create a wall of ice on a solid surface within range. You can form it into a hemispherical dome or a sphere with a radius of up to 10 feet, or you can shape a flat surface made up of ten 10-foot-square panels. Each panel must be contiguous with another panel. In any form, the wall is 1 foot thick and lasts for the duration.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 308,
      "name": "Wall of Stone",
      "desc": "A nonmagical wall of solid stone springs into existence at a point you choose within range. The wall is 6 inches thick and is composed of ten 10-foot-by-10-foot panels. Each panel must be contiguous with at least one other panel. Alternatively, you can create 10-foot-by-20-foot panels that are only 3 inches thick.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 309,
      "name": "Wall of Thorns",
      "desc": "You create a wall of tough, pliable, tangled brush bristling with needle-sharp thorns. The wall appears within range on a solid surface and lasts for the duration. You choose to make the wall up to 60 feet long, 10 feet high, and 5 feet thick or a circle that has a 20-foot diameter and is up to 20 feet high and 5 feet thick. The wall blocks line of sight.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 310,
      "name": "Warding Bond",
      "desc": "This spell wards a willing creature you touch and creates a mystic connection between you and the target until the spell ends. While the target is within 60 feet of you, it gains a +1 bonus to AC and saving throws, and it has resistance to all damage. Also, each time it takes damage, you take the same amount of damage.",
      "school": "Abjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 311,
      "name": "Water Breathing",
      "desc": "This spell gives a maximum of ten willing creatures within range and you can see, the ability to breathe underwater until the end of its term. Affected creatures also retain their normal breathing pattern.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 312,
      "name": "Water Walk",
      "desc": "This spell grants the ability to move across any liquid surface--such as water, acid, mud, snow, quicksand, or lava--as if it were harmless solid ground (creatures crossing molten lava can still take damage from the heat). Up to ten willing creatures you can see within range gain this ability for the duration.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 313,
      "name": "Web",
      "desc": "You conjure a mass of thick, sticky webbing at a point of your choice within range. The webs fill a 20-foot cube from that point for the duration. The webs are difficult terrain and lightly obscure their area.",
      "school": "Conjuration",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 314,
      "name": "Weird",
      "desc": "Drawing on the deepest fears of a group of creatures, you create illusory creatures in their minds, visible only to them. Each creature in a 30-foot-radius sphere centered on a point of your choice within range must make a wisdom saving throw. On a failed save, a creature becomes frightened for the duration. The illusion calls on the creature's deepest fears, manifesting its worst nightmares as an implacable threat. At the start of each of the frightened creature's turns, it must succeed on a wisdom saving throw or take 4d10 psychic damage. On a successful save, the spell ends for that creature.",
      "school": "Illusion",
      "components": "['V', 'S']"
    },
    {
      "id": 315,
      "name": "Wind Walk",
      "desc": "You and up to ten willing creatures you can see within range assume a gaseous form for the duration, appearing as wisps of cloud. While in this cloud form, a creature has a flying speed of 300 feet and has resistance to damage from nonmagical weapons. The only actions a creature can take in this form are the Dash action or to revert to its normal form. Reverting takes 1 minute, during which time a creature is incapacitated and can't move. Until the spell ends, a creature can revert to cloud form, which also requires the 1-minute transformation.",
      "school": "Transmutation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 316,
      "name": "Wind Wall",
      "desc": "A wall of strong wind rises from the ground at a point you choose within range. You can make the wall up to 50 feet long, 15 feet high, and 1 foot thick. You can shape the wall in any way you choose so long as it makes one continuous path along the ground. The wall lasts for the duration.",
      "school": "Evocation",
      "components": "['V', 'S', 'M']"
    },
    {
      "id": 317,
      "name": "Wish",
      "desc": "Wish is the mightiest spell a mortal creature can cast. By simply speaking aloud, you can alter the very foundations of reality in accord with your desires.",
      "school": "Conjuration",
      "components": "['V']"
    },
    {
      "id": 318,
      "name": "Word of Recall",
      "desc": "You and up to five willing creatures within 5 feet of you instantly teleport to a previously designated sanctuary. You and any creatures that teleport with you appear in the nearest unoccupied space to the spot you designated when you prepared your sanctuary (see below). If you cast this spell without first preparing a sanctuary, the spell has no effect.",
      "school": "Conjuration",
      "components": "['V']"
    },
    {
      "id": 319,
      "name": "Zone of Truth",
      "desc": "You create a magical zone that guards against deception in a 15-foot-radius sphere centered on a point of your choice within range. Until the spell ends, a creature that enters the spell's area for the first time on a turn or starts its turn there must make a Charisma saving throw. On a failed save, a creature can't speak a deliberate lie while in the radius. You know whether each creature succeeds or fails on its saving throw.",
      "school": "Enchantment",
      "components": "['V', 'S']"
    }
  ],
  "reviews": [
    {
      "id": 1,
      "userId": 1,
      "spellId": 1,
      "content": "Good against Trolls. Would use again.",
      "rating": 4
    },
    {
      "content": "animal friends",
      "rating": "2",
      "spellId": 6,
      "userId": 1,
      "id": 3
    },
    {
      "content": "You could make Lumierre!!!",
      "rating": 5,
      "spellId": 10,
      "userId": 1,
      "id": 4
    },
    {
      "content": "My go to for infiltration missions!!!",
      "rating": 5,
      "spellId": 5,
      "userId": 5,
      "id": 5
    },
    {
      "content": "",
      "rating": 5,
      "spellId": 3,
      "userId": 5,
      "id": 6
    },
    {
      "content": "Aids!!!",
      "rating": 5,
      "spellId": 3,
      "userId": 5,
      "id": 7
    },
    {
      "content": "Good against Batman!",
      "rating": 5,
      "spellId": 22,
      "userId": 5,
      "id": 8
    },
    {
      "content": "This splashes acid. neat",
      "rating": "3",
      "spellId": 2,
      "userId": 5,
      "id": 9
    }
  ]
}